# Используем официальный легковесный образ Python
FROM python:3.11-slim

# Устанавливаем переменные окружения, чтобы Python не буферизовал вывод
ENV PYTHONDONTWRITEBYTECODE 1
ENV PYTHONUNBUFFERED 1

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями и устанавливаем их
# Это кэшируется, ускоряя последующие сборки
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все остальные файлы проекта
COPY . .

# Указываем, какой порт контейнер будет "слушать"
EXPOSE 5000

# Устанавливаем команду по умолчанию.
# Она будет переопределена более сложной командой из docker-compose.yml,
# но это хорошая практика иметь ее здесь.
CMD ["python", "run.py"]